{
  "basics": {
    "name": "Sam Carrillo",
    "email": "scarrillo578@gmail.com",
    "phone": "(816) 721-4245",
    "website": "https://carrils.github.io/",
    "summary": "Goal-oriented software engineering professional with 4+ years of progressive experience supporting federal research and development projects for various sponsor agencies with The MITRE Corporation. Prior to MITRE, I developed and supported EHR systems with Oracle. Driven by a natural affinity for programmatic problem-solving, I am seeking to contribute to impactful projects and initiatives. Kansas City-based developer proficient in health data interoperability, steering complex technical conversations with stakeholders, and posessing clear communication skills.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Kansas City, Missouri"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "carrils",
        "url": "https://github.com/carrils"
      },
      {
        "network": "LinkedIn",
        "username": "sam-carrillo",
        "url": "https://www.linkedin.com/in/sam-carrillo"
      }
    ]
  },
  "work": [
    {
      "company": "MITRE | ASTP",
      "position": "Inferno",
      "startDate": "Nov. 2024",
      "endDate": "Apr. 2025",
      "summary": "Inferno is a ruby framework to test server-client conformance to FHIR messaging standards and Implementation Guides. My role for this project focused on being one of their primary developers, creating conformance test kits in Ruby.",
      "link": "/project/ASTP-Inferno",
      "highlights": [
        "Individual Contributor (technical)",
        "Developed Test Kits & internal team tooling; Carin for blue button, Bulk data, US CDI."
      ]
    },
    {
      "company": "MITRE | CMS",
      "position": "Hospital Price Transparency",
      "startDate": "Aug. 2022",
      "endDate": "Apr. 2024",
      "summary": "A project aimed to support and advise leadership at the Center for Medicare (CM) within CMS in the implementation of the Hospital Price Transparency final rule, 45 CFR part 180. My role on the project was a staff developer to assist in the creation of software for the implementation of the rule as well as general technical support.",
      "link": "/project/CMS-HPT",
      "highlights": [
        "Individual Contributor (technical)",
        "Developed core functionality on Hospital Price Transparency MRF validator. Maintained CMS github user site.",
        "Maintained documentation on an open-source CMSgov github repository, broad tasking including data collection and visualization. Aided in the development of the MRF validator for the rule."
      ]
    },
    {
      "company": "MITRE | ASTP",
      "position": "Public Health FHIR Implementation Collaborative (PHFIC)",
      "startDate": "May 2022",
      "endDate": "May 2023",
      "summary": "This project prototyped a public-private partnership established by MITRE and CDC to enable FHIR messaging capabilities for STLT health departments. My role on the project was to be a staff developer that assisted in the task of teaching and demonstrating FHIR software.",
      "link": "/project/ONC-PHFIC",
      "highlights": [
        "Task Leader",
        "Developed FHIR clients/servers and designed testing methods to implement health data messaging between STLT Health Departments and CDC.",
        "Developed an Inferno test suite for STLT stakeholders to use in setting up interoperable communication in the form of HL7 FHIR messaging. Aided in developing an IG. Stood up FHIR server and created FHIR client and server in HAPI FHIR."
      ]
    },
    {
      "company": "MITRE | CMS",
      "position": "Transparency in Coverage",
      "startDate": "Jan. 2022",
      "endDate": "Feb. 2024",
      "summary": "This project supported CMS (CM and CCIIO) in implementing the Transparency in Coverage final rule, 45 CFR Part 147. I assisted in the development of the MRF validator and managed its github repository.",
      "link": "/project/CMS-TiC",
      "highlights": [
        "Individual Contributor (technical)",
        "Informed Sponsor inquiry, compared Hospital and Insurer MRFs regarding rule with data analysis tools.",
        "Aided in development of the file validator, data collection & visualization. Assisted in producing data for research questions. Processed JSON files in an environmental scan."
      ]
    },
    {
      "company": "MITRE | AHRQ",
      "position": "CDS Connect",
      "startDate": "Jun. 2021",
      "endDate": "Aug. 2024",
      "summary": "Clinical Decision Support (CDS) Connect is a public platform for authoring and sharing interoperable CDS resources. I was a full stack developer, I helped develop and maintain the Artifact Repository as well as help administer the website in general.",
      "link": "/project/AHRQ-CDS-Connect",
      "highlights": [
        "Individual Contributor (technical)",
        "Full stack developer and repository maintainer, supported the implementation of the Artifact repository and website."
      ]
    },
    {
      "company": "Oracle Health",
      "position": "Systems Engineer II",
      "startDate": "Oct. 2018",
      "endDate": "Feb. 2021",
      "summary": "Developed and supported clinical applications and the transmission of health data for bedside medical devices.",
      "link": "",
      "highlights": [
        "fill with stuff from the_way",
        "fill with stuff from the_way"
      ]
    }
  ],
  "skills": [
    {
      "name": "",
      "level": 1,
      "keywords": [
        "Python",
        "Java",
        "Javascript",
        "Ruby",
        "Pandas",
        "Drupal"
      ]
    },
    {
      "name": "",
      "level": 2,
      "keywords": [
        "FHIR Server/Client development",
        "Health Systems Engineering",
        "EHR/EMR Development",
        "Software Interoperability",
        "Agile development",
        "Project Task Management",
        "Stakeholder Engagement & Analysis"
      ]
    }
  ],
  "education": [
    {
      "institution": "Missouri Western State University",
      "area": "BS in Computer Science",
      "studyType": "",
      "startDate": "",
      "endDate": "May 2018",
      "courses": []
    }
  ],
  "languages": [],
  "interests": [],
  "references": [],
  "projects": [
    {
      "name": "CDS Connect",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "Clinical Decision Support (CDS) Connect is a public platform for authoring and sharing interoperable CDS resources"
    },
    {
      "name": "Hospital Price Transparency",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A project supporting the CMS initiative for Hospital Price Transparency"
    },
    {
      "name": "Inferno",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A ruby framework to test server-client conformance to FHIR messaging standards and Implementation Guides"
    },
    {
      "name": "Public Health FHIR Implementation Collaborative (PHFIC)",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "Public-private partnership to established by MITRE and CDC to enable FHIR implementation in STLT health departments"
    },
    {
      "name": "Transparency In Coverage",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A project supporting the CMS initiative for Healthcare Price Transparency"
    }
  ]
}