{
  "basics": {
    "name": "Sam Carrillo",
    "email": "scarrillo578@gmail.com",
    "phone": "(816) 721-4245",
    "website": "https://carrils.github.io/",
    "summary": "Goal-oriented software engineering professional with 4+ years of progressive experience supporting federal research and development projects for various sponsor agencies with The MITRE Corporation. Prior to MITRE, I developed and supported EHR systems with Oracle. Driven by a natural affinity for programmatic problem-solving, I am seeking to contribute to impactful projects and initiatives. Kansas City-based developer proficient in health data interoperability, steering complex technical conversations with stakeholders, and posessing clear communication skills.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Kansas City, Missouri"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "carrils",
        "url": "https://github.com/carrils"
      },
      {
        "network": "LinkedIn",
        "username": "sam-carrillo",
        "url": "https://www.linkedin.com/in/sam-carrillo"
      }
    ]
  },
  "work": [
    {
      "company": "MITRE | ASTP",
      "position": "Inferno",
      "startDate": "Nov. 2024",
      "endDate": "Apr. 2025",
      "summary": "Inferno is a ruby framework to test server-client conformance to FHIR messaging standards and Implementation Guides. My role for this project focused on being one of their primary developers, creating conformance test kits in Ruby.",
      "link": "/project/ASTP-Inferno",
      "highlights": [
        "Developed internal team tooling to assist in the automation of test kit creation",
        "Contributed to the development of multiple test kits; Carin for blue button, Bulk data, US CDI"
      ]
    },
    {
      "company": "MITRE | CMS",
      "position": "Hospital Price Transparency",
      "startDate": "Aug. 2022",
      "endDate": "Apr. 2024",
      "summary": "A project aimed to support and advise leadership at the Center for Medicare (CM) within CMS in the implementation of the Hospital Price Transparency final rule, 45 CFR part 180. My role on the project was a staff developer to assist in the creation of software for the implementation of the rule as well as general technical support.",
      "link": "/project/CMS-HPT",
      "highlights": [
        "Developed core functionality on Hospital Price Transparency MRF validator, maintained its CMS github user site.",
        "Data collection, visualization and transformation using Machine-Readable-Files (JSON, CSV, XML) to inform policy-making decisions for stakeholders"
      ]
    },
    {
      "company": "MITRE | ASTP",
      "position": "Public Health FHIR Implementation Collaborative (PHFIC)",
      "startDate": "May 2022",
      "endDate": "May 2023",
      "summary": "This project prototyped a public-private partnership established by MITRE and CDC to enable FHIR messaging capabilities for STLT health departments. My role on the project was to be a staff developer that assisted in the task of demonstrating the creation and use FHIR software.",
      "link": "/project/ONC-PHFIC",
      "highlights": [
        "Created and demonstrated functional FHIR implementations of client and server software",
        "Designed and conducted client/server testing between State and Local Health Departments"
      ]
    },
    {
      "company": "MITRE | CMS",
      "position": "Transparency in Coverage",
      "startDate": "Jan. 2022",
      "endDate": "Feb. 2024",
      "summary": "This project supported CMS (CM and CCIIO) in implementing the Transparency in Coverage final rule, 45 CFR Part 147. I assisted in the development of the MRF validator and managed its github repository.",
      "link": "/project/CMS-TiC",
      "highlights": [
        "Developed XML file validation in the MRF File Validator",
        "Informed Sponsor inquiry by creating new tools to compare Hospital and Insurer MRFs regarding rule."
      ]
    },
    {
      "company": "MITRE | AHRQ",
      "position": "CDS Connect",
      "startDate": "Jun. 2021",
      "endDate": "Aug. 2024",
      "summary": "Clinical Decision Support (CDS) Connect is a public platform for authoring and sharing interoperable CDS resources. I was a full stack developer, I helped develop and maintain the Artifact Repository as well as help administer the website in general.",
      "link": "/project/AHRQ-CDS-Connect",
      "highlights": [
        "Fullstack (LAMP) developer on Acquia Cloud",
        "General website administration & technical support"
      ]
    },
    {
      "company": "Oracle Health",
      "position": "Systems Engineer II",
      "startDate": "Oct. 2018",
      "endDate": "Feb. 2021",
      "summary": "Supported and developed clinical applications using the transmission of health data from bedside medical devices. Solutions include PowerChart, FetaLink, and transmission of health data over the interoprability bus",
      "link": "",
      "highlights": [
        "Supported Bedside Medical Device Interface (BMDI) health data transmission to Millennium solutions in Direct Care",
        "Served in on-call rotation for tier 2 senior engineer support"
      ]
    }
  ],
  "skills": [
    {
      "name": "",
      "level": 1,
      "keywords": [
        "Python",
        "Java",
        "Javascript",
        "Ruby",
        "Pandas",
        "Drupal"
      ]
    },
    {
      "name": "",
      "level": 2,
      "keywords": [
        "FHIR Server/Client development",
        "Health Systems Engineering",
        "EHR/EMR Development",
        "Software Interoperability",
        "Agile development",
        "Project Task Management",
        "Stakeholder Engagement & Analysis"
      ]
    }
  ],
  "education": [
    {
      "institution": "Missouri Western State University",
      "area": "BS in Computer Science",
      "studyType": "",
      "startDate": "",
      "endDate": "May 2018",
      "courses": []
    }
  ],
  "languages": [],
  "interests": [],
  "references": [],
  "projects": [
    {
      "name": "CDS Connect",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "Clinical Decision Support (CDS) Connect is a public platform for authoring and sharing interoperable CDS resources"
    },
    {
      "name": "Hospital Price Transparency",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A project supporting the CMS initiative for Hospital Price Transparency"
    },
    {
      "name": "Inferno",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A ruby framework to test server-client conformance to FHIR messaging standards and Implementation Guides"
    },
    {
      "name": "Public Health FHIR Implementation Collaborative (PHFIC)",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "Public-private partnership to established by MITRE and CDC to enable FHIR implementation in STLT health departments"
    },
    {
      "name": "Transparency In Coverage",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A project supporting the CMS initiative for Healthcare Price Transparency"
    }
  ]
}