[
  {
    "position": "Inferno",
    "company": "MITRE | ASTP",
    "startDate": "Nov. 2024",
    "endDate": "Apr. 2025",
    "summary": "Inferno is an open source framework for creating, executing and sharing server/client conformance tests for the FHIR messaging standard. Inferno tests are packaged into executable Test Kits, which test and report a server or clients conformance to a FHIR Implementation Guide.",
    "link": "/project/ASTP-Inferno",
    "highlights": [
      "Individual Contributor (technical)",
      "Developed Test Kits & internal team tooling; Carin for blue button, Bulk data, US CDI."
    ]
  },
  {
    "position": "Hospital Price Transparency",
    "company": "MITRE | CMS",
    "startDate": "Aug. 2022",
    "endDate": "Apr. 2024",
    "summary": "This project supported CMS in implementing their Hospital Price Transparency rule (<a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-E/part-180\">45 CFR part 180</a>).",
    "link": "/project/CMS-HPT",
    "highlights": [
      "Individual Contributor (technical)",
      "Developed core functionality on Hospital Price Transparency MRF validator. Maintained CMS github user site.",
      "Maintained documentation on an open-source CMSgov github repository, broad tasking including data collection and visualization. Aided in the development of the MRF validator for the rule."
    ]
  },
  {
    "position": "Public Health FHIR Implementation Collaborative (PHFIC)",
    "company": "MITRE | ASTP",
    "startDate": "May 2022",
    "endDate": "May 2023",
    "summary": "This project prototyped a public-private partnership between STLT health departments, MITRE, and CDC for increased messaging capability using the FHIR standard.",
    "link": "/project/ONC-PHFIC",
    "highlights": [
      "Task Leader",
      "Developed FHIR clients/servers and designed testing methods to implement health data messaging between STLT Health Departments and CDC.",
      "Developed an Inferno test suite for STLT stakeholders to use in setting up interoperable communication in the form of HL7 FHIR messaging. Aided in developing an IG. Stood up FHIR server and created FHIR client and server in HAPI FHIR."
    ]
  },
  {
    "position": "Transparency in Coverage",
    "company": "MITRE | CMS",
    "startDate": "Jan. 2022",
    "endDate": "Feb. 2024",
    "summary": "This project supported CMS implementing a rule similar to Hospital Price Transparency but for insurance, Transparency in Coverage. (<a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-B/part-147\">45 CFR Part 147</a>).",
    "link": "/project/CMS-TiC",
    "highlights": [
      "Individual Contributor (technical)",
      "Informed Sponsor inquiry, compared Hospital and Insurer MRFs regarding rule with data analysis tools.",
      "Aided in development of the file validator, data collection & visualization. Assisted in producing data for research questions. Processed JSON files in an environmental scan."
    ]
  },
  {
    "position": "CDS Connect",
    "company": "MITRE | AHRQ",
    "startDate": "Jun. 2021",
    "endDate": "Aug. 2024",
    "summary": "Clinical Decision Support (CDS) Connect is a public platform for authoring and sharing interoperable CDS resources. These resources are hosted on a publicly accessible repository with other clinical information meant to aid clinical decision making.",
    "link": "/project/AHRQ-CDS-Connect",
    "highlights": [
      "Individual Contributor (technical)",
      "Full stack developer and repository maintainer, supported the implementation of the Artifact repository and website."
    ]
  },
  {
    "position": "Systems Engineer II",
    "company": "Oracle Health",
    "startDate": "Oct. 2018",
    "endDate": "Feb. 2021",
    "summary": "Developed and supported clinical applications and the transmission of health data for bedside medical devices.",
    "link": "",
    "highlights": [
      "fill with stuff from the_way",
      "fill with stuff from the_way"
    ]
  }
]
